<template>
  <div class="background"></div>
  <main>
            <h1>Условия приема</h1>
            <p>Важно! Внимательно ознакомьтесь с данными условиями перед тем, как заселиться в гостиницу.
                Мы принимаем только здоровых домашних животных не младше 6 месяцев, прошедших комплексную вакцинацию
                и
                имеющих ветеринарный паспорт с соответствующими отметками.<br>
            </p>
            <p>
                Если со времени последней вакцинации прошло более 11-и месяцев, то прививку необходимо повторить.
            </p>
            <p>
                Категорически не рекомендуем делать прививку животным накануне заселения в гостиницу, т.к. после
                вакцинации должен пройти карантин в три недели!<br>
            </p>
            <p>
                В случае отсутствия при заезде ветеринарных документов о действующей прививке, мы будем вынуждены
                отказать такому животному в заселении, в этом случае бронь не возвращается.<br>
            </p>
            <p>
                Животные с признаками беременности не принимаются.<br>
            </p>
            <p>
                При необходимости перед заездом в гостиницу животное нужно обработать от паразитов.<br>
            </p>
            <p>
                НЕКАСТРИРОВАННЫЕ СОБАКИ СТАРШЕ 7 МЕСЯЦЕВ НЕ ПРИНИМАЮТСЯ!
            </p>
        </main>
</template>

<script>
export default {
  name: 'AdmissionPage',
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

h1,
p {
  color: azure;
  font-family: 'Roboto', Arial, sans-serif;
}

main {
  margin-left: 40px;
  font-size: 22px;
  text-align: initial;
}


</style>
