<template>
  <main>
    <div class="background"></div>
    <div class="city">
      <h1>Города Мексики</h1>
      <p>Мексика представляет собой неповторимый коктейль, в котором гармонично сплелись испанская, индейская
        и карибская культуры. Уникальный местный колорит, богатая история воинственного народа, потрясающие
        природные пейзажи и зажигательный темперамент мексиканцев заманивают туристов со всего мира. Мы
        постараемся детально разобраться, как живёт эта яркая страна, чем Мексика и её жители способны
        удивить даже бывалого туриста и на что непременно стоит обратить внимание, странствуя по
        мексиканским долинам. Вас ждёт захватывающее путешествие на родину текилы и тортильи, которое не
        оставит ни единого сомнения в том, что Мексика – это колоритная сказка с острым привкусом чили на
        губах!</p>
    </div>
    <section>
      <div class="imgblock" title="Показать детальную информацию" @click="showDetails('mexico')">
        <!-- двойные кавычки в html -->
        <img src='@/assets/mexico1.jpg'>
        <span>Мехико</span>
      </div>
      <div class="details" v-if="city === 'mexico'">
        <img src='@/assets/mexico1.jpg'><br/>
       Мехико – живописная столица и самый густонаселённый город Мексики, но на этом список его достижений не
            заканчивается. Протяжённостью столица уступает только Токио и Нью-Йорку, а в пределах Латинской Америки и
            вовсе занимает лидирующую позицию. Мехико – центр социальной, экономической, научной и политической сфер.
            Мода, развлечения, туризм, искусство и культура – всё это делает город главной ареной страны, где ежегодно
            разворачиваются политические митинги, красочные фестивали и многолюдные празднества.
      </div>
      <div class='imgblock' @click="showDetails('kankun')">
        <img src='@/assets/cancun.jpg'>
        <span>Канкун</span>
      </div>
      <div class="details" v-if="city === 'kankun'">
        <img src='@/assets/cancun.jpg'><br/>
        Самый популярный город-курорт в Мексике. Он расположен на восточном побережье полуострова Юкатан, в штате Кинтана-Роо, на юго-востоке страны.
        Канкун славится, прежде всего, своей белоснежной песчаной косой, выходящей к бирюзовым водам Карибского моря. Она имеет ширину 400 м и длину 30 км, а из иллюминаторов самолета напоминает туристам цифру «7». <br>
        Пляжи Канкуна появляются на заставках рабочего стола у людей по всему миру, поскольку именно этот курорт ассоциируется с мечтой об идеальном отдыхе.<br>
      </div>
      <div class='imgblock' @click="showDetails('guadalajara')">
        <img src='@/assets/guadalajara.jpg'>
        <span>Гвадалахара</span>
      </div>
      <div class="details" v-if="city === 'guadalajara'">
        <img src='@/assets/guadalajara.jpg'><br/>
        Второй по величине город Мексики, который за обилие садов и парков называют «Городом роз» и «Жемчужиной Запада». Он был основан в середине XVI века и сегодня является главным городом мексиканского штата Халиска, а также культурным, экономическим и транспортным центром всего юго-запада страны.
      </div>
      <div class='imgblock' @click="showDetails('merida')">
        <img src='@/assets/merida.jpg'>
        <span> Мерида</span>
      </div>
      <div class="details" v-if="city === 'merida'">
        <img src='@/assets/merida.jpg'><br>
          Столица штата Юкатан, построенная на руинах города майя Тихо (T'ho или Ichcansiho). Как только испанцы победили, они разрушили пирамиды и построили кафедральный собор Сан-Идельфонсо, самый старый на североамериканском континенте. Сегодня Мерида – город, которому есть чем гордиться: его население около 750 000 человек, и он по праву называется культурным центром полуострова.
      </div>
      <div class='imgblock' @click="showDetails('acapulco')">
        <img src='@/assets/acapulco.jpg'>
        <span>Акапулько</span>
      </div>
      <div class="details" v-if="city === 'acapulco'">
      <img src='@/assets/acapulco.jpg'><br>
      Порт и самый популярный курорт на тихоокеанском побережье Мексики. Наряду с Канкуном, находящимся на Карибском побережье, является самым популярным морским курортом страны. Акапулько прославился как курорт в 60-е, когда здесь стали отдыхать от суеты голливудские знаменитости. Побывавшие в Акапулько режиссеры прониклись красотами местных пляжей и принялись снимать здесь сцены для своих фильмов. Волна интереса росла, словно снежный ком, и вскоре кинозвезды начали покупать курортную недвижимость и прогулочные яхты.
    </div>
      <div class='imgblock' @click="showDetails('oaxacao')">
        <img src='@/assets/oaxaca.jpg'>
        <span>Оахака</span>
      </div>
      <div class="details" v-if="city === 'oaxaca'">
      <img src='@/assets/oaxaca.jpg'><br>
      Или Оахака-де-Хуарес – город на юге Мексики, столица одноимённого штата Оахака. Расположен в горах Сьерра-Мадре-дель-Сур, в 480 км от Мехико.
    </div>
      <div class='imgblock' @click="showDetails('valladolid')">
        <img src='@/assets/valladolid.jpg'>
        <span>Вальядолид</span>
      </div>
      <div class="details" v-if="city === 'valladolid'">
      <img src='@/assets/valladolid.jpg'><br>
      Вальядолид (мексиканцы произносят «Байялолид») — прелестный колониальный город на полпути между Меридой и Канкуном. Он был основан в 1552 г. Здесь находится одно из красивейших зданий колониальной эры — церковь Сан-Бернардино-де-Сиена. Сенот Дситнуп (Cenote Dzitnup), расположенный в южной части города, — это красивейший подземный колодец со сталактитами; если вы любите острые ощущения, вам сюда; поплавать здесь тоже можно. Сенот Саси (Zaci) находится в центре города; сюда ходят поплавать и понырять с маской, потому что здесь водится редкая слепая, вернее, безглазая рыба (Anoptichthys jordani); местные жители называют ее «луб».
Вальядолид расположен в 40 км к востоку от Чичен-Ицы, между Меридой и Канкуном; автобусы регулярно курсируют между этими городами. Если вы путешествуете на автомобиле, учтите: платная дорога короче, зато шоссе Carretera 180 петляет между живописными деревушками.
    </div>
      <div class='imgblock' @click="showDetails('tijuana')">
        <img src='@/assets/tijuana.jpg'>
        <span>Тихуана</span>
      </div>
      <div class="details" v-if="city === 'tijuana'">
        <img src='@/assets/tijuana.jpg'><br/>
        Город на северо-западе Мексики, крупнейший в штате Нижняя Калифорния и самый западный во всей Латинской Америке. Расположен в 170 км от столицы штата — Мехикали и в часе езды от портового города Энсенада. Тихуана также является административным центром одноимённого муниципалитета. Отделен государственной границей от города-побратима в США — Сан-Диего, а общая численность населения этих городов превышает 5 млн человек.
      </div>
      <div class='imgblock' @click="showDetails('ciudadjuarez')">
        <img src='@/assets/ciudadjuarez.jpg'>
        <span>Cьюдад-Хуарес</span>
      </div>
      <div class="details" v-if="city === 'ciudadjuarez'">
      <img src='@/assets/ciudadjuarez.jpg'><br/>
      Город в Мексике, расположенный в северной части штата Чиуауа, на реке Рио-Гранде. Располагаясь на границе с США, Хуарес является важным транспортным узлом, одним из главных перевалочных пунктов между Мексикой и США. На противоположном берегу Рио-Гранде находится крупный американский город Эль-Пасо, вместе с которым Хуарес образует пограничную агломерацию. В городе стремительно развивается промышленность, ориентированная на американский экспорт. Город обслуживает международный аэропорт Абраам Гонсалес.
    </div>
      <div class='imgblock' @click="showDetails('carmen')">
        <img src='@/assets/carmen.jpg'>
        <span>Плайя-дель-Кармен</span>
      </div>
      <div class="details" v-if="city === 'carmen'">
        <img src='@/assets/carmen.jpg'>
        Мексиканский курорт, расположенный в 64 км к югу от Канкуна. Он намного меньше, и атмосфера здесь почти европейская. До начала 1980-х Плайя — так ее обычно называют — была простой рыбацкой деревней. Сегодня это один из самых быстрорастущих населенных пунктов Мексики. Сюда съезжаются на отдых не только мексиканцы, которых здесь можно встретить в уик-энды, но множество людей со всего мира. Кроме всего прочего, здесь дважды в неделю швартуются огромные круизные лайнеры, пополняя местное население. 
      </div>
      <div class='imgblock' @click="showDetails('akumal')">
        <img src='@/assets/akumal.jpg'>
        <span>Акумаль</span>
      </div>
      <div class="details" v-if="city === 'akumal'">
      <img src='@/assets/akumal.jpg'><br/>
      Название небольшого курорта Акумаль переводится с языка майя как «Черепаший». Он расположен в самом сердце Майянской Ривьеры. Когда-то здесь выращивали кокосы, а в 1950-х Акумаль стал туристическим центром — именно тогда здесь был создан эксклюзивный центр дайвинга. Население, состоявшее из индейцев майя, перебралось в новый городок, выстроенный по ту сторону шоссе, и сегодня в Акумале живут в основном американцы — их здесь больше, чем где-либо еще на побережье. Несмотря на то, что это старейший курорт Ривьеры-Майя, в нем до сих пор сохраняется атмосфера непринужденности и некой таинственности. Самое привлекательное в Акумале — прекрасные пляжи, живописная лагуна и буйные джунгли, где обитает множество разнообразных диких животных и птиц. Жизнь дикой природы можно наблюдать даже во время короткой прогулки, поездки на велосипеде или более длительной, организованной экскурсии.
      </div>

      <div class='imgblock' @click="showDetails('morelos')">
        <img src='@/assets/morelos.jpg'>
        <span>Пуэрто Морелос</span>
      </div>
      <div class="details" v-if="city === 'morelos'">
      <img src='@/assets/morelos.jpg'><br/>
      Тихая и спокойная деревня, расположенная вдали от шоссе, ее часто сравнивают с Плайя-дель-Кармен, какой она была 25 лет назад. Местные жители до сих пор живут дарами моря, а туристы могут здесь целиком уйти в настоящую мексиканскую реальность; здешние цены нельзя даже сравнивать с канкунскими.
      </div>
      <div class='imgblock' @click="showDetails('aventures')">
        <img src='@/assets/aventures.jpg'>
        <span>Пуэрто Авентурас</span>
      </div>
      <div class="details" v-if="city === 'aventures'">
      <img src='@/assets/aventures.jpg'><br/>
        Небольшой город, расположенный в 15 минутах езды от Плайя-дель-Кармен, отсюда очень удобно ездить по всей Ривьере-Майя. Это закрытый район, и от крупнейших курортов его отделяет целый мир. Частная застройка на площади 365 га производилась вокруг обширной марины и включала пляжный клуб, рестораны международной кухни, дайвинг-центр и поле для гольфа на 9 лунок.

Местные жители называют его просто «Пуэрто»; обитатели гордятся круглосуточной охраной. По ночам здесь можно спокойно ходить и ездить, все уличные торговцы под контролем, вы не столкнетесь здесь с хулиганством и буйством, нередкими в близлежащих Канкуне и Плайя-дель-Кармен. Больших отелей тут немного, в основном виллы и апартаменты; все это сделало Пуэрто-Авентурас популярным курортом для семейного отдыха.
</div>
      <div class='imgblock' @click="showDetails('allende')">
        <img src='@/assets/allende.jpg'>
        <span>Сан-Мигель-Альенде</span>
      </div>
      <div class="details" v-if="city === 'allende'">
        <img src='@/assets/allende.jpg'><br/>
        Город в Мексике, административный центр одноимённого муниципалитета в мексиканском штате Гуанахуато.
Центром города является старинная площадь Хардин. Здесь находятся очень красивые церкви Темпло де Сан Рафаэль и Паррокия де Сан Мигель Аркангел XVII-XVIII вв., чудесный образец стиля барокко с неоготической башней, пристроенной в конце XIX века. Согласно слухам, архитектор создал проект по открыткам с изображениями европейских соборов. Рядом расположен Каса де Альенде – образцовый особняк в стиле строений испанской знати XVIII века.
      </div>
    </section>
  </main>
</template>

<script>
export default {
  name: 'CityPage',
  data: function () {
    return {
      city: null,
    }
  },
  methods: {
    showDetails: function (city) {
      console.log('city:', city)
      this.city = city
    },
  },
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
@keyframes anspl {
  0% {
    opacity: 0;
    transform: translateY(-50px)
  }

  100% {
    opacity: 1;
    transform: translateY(0)
  }
}

.background {
  background: url('@/assets/bodyinfo.jpg');
  /* width: 100%;
  height: 100%;
  position: fixed;
  z-index: -1; */
}

p {
  color: azure;
  text-align: justify;
  font-size: 20px;
}

section {
  transition: .2s;
  display: flex;
  flex-direction: row;
  flex-wrap: wrap;
  color: aqua;
  font-size: 21px;
}

.imgblock {
  position: relative;
  display: inline-block;
  cursor: pointer;
}

.imgblock img {
  height: 160px;
  width: 250px;
  
}

.imgblock span {
  /*background: rgba(0,0,0,0.7); (полупрозрачность)*/
  background: #222;
  color: #fff;
  border-radius: 2px;
  position: absolute;
  right: 0;
  bottom: 10px;
  font-size: 18px;
  padding: 3px 5px;
}

/*.img {
	background: url('@/assets/information.jpg');
	height: 900px;
	width: 1800px;
}*/

.details {
  padding: 20px;
  text-align: left;
}

.details>img {
  height: 460px;
  width: 550px;
  float: left;
  margin: 10px;
}

details {
  min-height: 5px;
  padding: 25px 70px 25px 25px;
  margin: 0 auto;
  position: relative;
  font-size: 22px;
  border: 1px solid #333;
  border-radius: 10px;
  box-sizing: border-box;
  transition: all .3s;
}

details+details {
  margin-top: 20px;
}

details[open] {
  min-height: 50px;
}

details[open] summary~* {
  animation: anspl .3s cubic-bezier(.52, .41, .75, .74);
}

details p {
  color: rgb(187, 183, 183);
  font-weight: 400;
  margin: 15px 0;
}

details p:last-child {
  margin-bottom: 0px;
}

summary {
  display: flex;
  align-items: center;
  font-weight: 500;
  cursor: pointer;
}

summary:focus {
  outline: none;
}

summary::-webkit-details-marker {
  display: none
}

/*summary::before {
    content: '+';
    padding-right: 0.5em;
}
details[open]>summary::before {
    content: '-';
}*/
</style>
