<template>
 <div class="background"></div>
 <div class="info">
  <h2>Исторические и культурные традиции Мексики</h2>
  <p>В доколумбовый период мексиканской истории территория страны входила в состав государств ольмеков и майя. В XII веке Центральную Мексику завоевали ацтеки, сделав ее центром огромной империи. Сейчас от этих цивилизаций остались только народные легенды, величественные пирамиды древних городов.После прихода в Америку испанцев на мексиканскую культуру огромное влияние оказала католическая церковь. Вместе с индейскими жрецами из национальных обрядов ушли кровавые ритуалы с человеческими жертвоприношениями, культы кровожадных богов. Испанцы вместе с новыми верованиями принесли в страну европейскую письменность. В католических церковных школах коренное население учили счету и письму, что отразилось на всех сторонах жизни.
Три века испанского колониального владычества (с 1521 по 1821 год) принесли мексиканцам не только подневольный труд на плантациях. Сегодня 93 % мексиканцев говорит только на испанском языке, грамотность населения достигла 91 %. В стране появились литература, наука, изобразительное искусство.

Индейское искусство фрески поднял на новые высоты, осовременил, сделал национальной традицией художник Альфаро Сикейрос.
Из населения в 133 миллиона человек большинство составляют мексиканцы (смешанные потомки коренных индейцев с испанцами). Из старых обычаев народа мексиканцы сохранили празднование «Дня мертвых» и национальный костюм.</p>
<h2>Традиции мексиканского костюма</h2>
<p>В первоначальном виде традиционный костюм носят только сельские жители Мексики. Несмотря на экзотический вид, его главные элементы функциональны:</p>
<ul>
     <li>широкополая соломенная шляпа сомбреро, пришедшая из Испании, хорошо защищает от жаркого солнца;</li>
     <li>легкая накидка «пати» используется в полевых работах;</li>
     <li>шерстяная накидка «пончо» с вырезом для головы быстро надевается, когда на среднегорье холодает;</li>
     <li>женская длинная юбка защищает мексиканок от солнца и холода;</li>
     <li>кожаные сандалии «гуарачи» мало изменились с индейских времен, они удобны, прочно крепятся на ноге ремешками, медленно изнашиваются.</li>
   </ul>
   <p>В обычной жизни городские жители современной Мексики надевают традиционные наряды только на карнавалы, для семейных фотографий. В пончо и сомбреро с удовольствием фотографируются и иностранные туристы.</p>
<div class="photo"></div>
<h2>Обычаи мексиканцев в быту</h2>
<p>В обычной жизни мексиканцы приветливы и добродушны, любят веселье. При встрече мужчинам пожимают руку, женщин целуют в щечку. К знакомым и друзьям обращаются по имени. При общении с незнакомыми людьми обязательно вежливое обращение «сеньор», «сеньора», «сеньорита». Признаком уважения считается добавление к обращению званий собеседника «директор», «президент», «доктор», «профессор».<br>

Среди бытовых привычек, которые непривычны европейцам, можно выделить:</p>
<ul>
     <li>регулярные опоздания — норма для мексиканцев, на это никто не обращает внимания;</li>
     <li>в гостях не разуваются (даже если на улице грязь);</li>
     <li>долгие разговоры о посторонних вещах, прежде чем перейти к делу;</li>
     <li>мексиканцы постоянно отвлекаются (даже во время деловой беседы) на телефонные звонки;</li>
     <li>обычай стоять очень близко к собеседнику.</li>
</ul>
<p>Мексиканские семьи любят и охотно принимают гостей. Друзья и знакомые могут приходить в гости без особого приглашения и разрешения. В общении мексиканцы не скрывают своих эмоций, много жестикулируют, могут говорить громко. Женщинам принято дарить цветы. Но это обязательно должен быть большой букет. Один цветок мексиканцы никогда не дарят.</p>

</div>
</template>

<script>
export default {
  name: 'CulturePage', 
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>


.background {
	background: url('@/assets/culture.jpg');
	z-index: -1;
    width: 100%;
    height: 100%;
    position: fixed;
    filter: blur(3px);
}

.info{
  color: black;


}

p, ul{
  text-align: justify;
  font-size: 20px;
}

.photo {
	background: url('@/assets/photo.jpg');
	height: 532px;
	width: 800px;
  display: inline-block;
}
</style>
