<template>
  <div class="background"></div>
  <div class="info">
    <h2>Исторические и культурные традиции Мексики</h2>
    <p>В доколумбовый период мексиканской истории территория страны входила в состав государств ольмеков и майя. В XII
      веке Центральную Мексику завоевали ацтеки, сделав ее центром огромной империи. Сейчас от этих цивилизаций остались
      только народные легенды, величественные пирамиды древних городов.После прихода в Америку испанцев на мексиканскую
      культуру огромное влияние оказала католическая церковь. Вместе с индейскими жрецами из национальных обрядов ушли
      кровавые ритуалы с человеческими жертвоприношениями, культы кровожадных богов. Испанцы вместе с новыми верованиями
      принесли в страну европейскую письменность. В католических церковных школах коренное население учили счету и
      письму, что отразилось на всех сторонах жизни.
      Три века испанского колониального владычества (с 1521 по 1821 год) принесли мексиканцам не только подневольный
      труд на плантациях. Сегодня 93 % мексиканцев говорит только на испанском языке, грамотность населения достигла 91
      %. В стране появились литература, наука, изобразительное искусство.

      Индейское искусство фрески поднял на новые высоты, осовременил, сделал национальной традицией художник Альфаро
      Сикейрос.
      Из населения в 133 миллиона человек большинство составляют мексиканцы (смешанные потомки коренных индейцев с
      испанцами). Из старых обычаев народа мексиканцы сохранили празднование «Дня мертвых» и национальный костюм.</p>
    <h2>Традиции мексиканского костюма</h2>
    <p>В первоначальном виде традиционный костюм носят только сельские жители Мексики. Несмотря на экзотический вид, его
      главные элементы функциональны:</p>
    <ul>
      <li>широкополая соломенная шляпа сомбреро, пришедшая из Испании, хорошо защищает от жаркого солнца;</li>
      <li>легкая накидка «пати» используется в полевых работах;</li>
      <li>шерстяная накидка «пончо» с вырезом для головы быстро надевается, когда на среднегорье холодает;</li>
      <li>женская длинная юбка защищает мексиканок от солнца и холода;</li>
      <li>кожаные сандалии «гуарачи» мало изменились с индейских времен, они удобны, прочно крепятся на ноге ремешками,
        медленно изнашиваются.</li>
    </ul>
    <p>В обычной жизни городские жители современной Мексики надевают традиционные наряды только на карнавалы, для
      семейных фотографий. В пончо и сомбреро с удовольствием фотографируются и иностранные туристы.</p>
    <div class="photo"></div>
    <h2>Обычаи мексиканцев в быту</h2>
    <p>В обычной жизни мексиканцы приветливы и добродушны, любят веселье. При встрече мужчинам пожимают руку, женщин
      целуют в щечку. К знакомым и друзьям обращаются по имени. При общении с незнакомыми людьми обязательно вежливое
      обращение «сеньор», «сеньора», «сеньорита». Признаком уважения считается добавление к обращению званий собеседника
      «директор», «президент», «доктор», «профессор».<br>

      Среди бытовых привычек, которые непривычны европейцам, можно выделить:</p>
    <ul>
      <li>регулярные опоздания — норма для мексиканцев, на это никто не обращает внимания;</li>
      <li>в гостях не разуваются (даже если на улице грязь);</li>
      <li>долгие разговоры о посторонних вещах, прежде чем перейти к делу;</li>
      <li>мексиканцы постоянно отвлекаются (даже во время деловой беседы) на телефонные звонки;</li>
      <li>обычай стоять очень близко к собеседнику.</li>
    </ul>
    <p>Мексиканские семьи любят и охотно принимают гостей. Друзья и знакомые могут приходить в гости без особого
      приглашения и разрешения. В общении мексиканцы не скрывают своих эмоций, много жестикулируют, могут говорить
      громко. Женщинам принято дарить цветы. Но это обязательно должен быть большой букет. Один цветок мексиканцы
      никогда не дарят.</p>
    <h2>Семейные традиции в Мексике</h2>
    <p>Мексиканские мужчины ответственно относятся к семье. В собственных домах или квартирах (в крупных городах) живет
      до 85 % населения Мексики. Выбирать невесту мексиканец начинает не раньше, чем накопит денег на жилье. Поэтому
      женятся мексиканские мужчины чаще всего после 30 лет.

      Мексиканская свадьба начинается с венчания в церкви по католическому обряду. На свадебной церемонии невеста одета
      в белое платье, жених может быть в расшитом позументами и вышивкой старинном мексиканском «асьендадос». На
      мексиканской свадьбе с большим количеством гостей есть ряд традиционных обычаев:</p>
    <ul>
      <li>невеста с женихом приезжают в церковь отдельно;</li>
      <li>гражданская регистрация брака проводится после церковного венчания;</li>
      <li>невеста не украшает себя жемчугом, меняет 3 букета цветов;</li>
      <li>на выходе из церкви молодоженов осыпают рисом или лепестками цветов;</li>
      <li>пышное застолье начинается с вальса жениха и невесты;</li>
      <li>для вручения денег семейные пары танцуют с невестой и женихом, наклеивая купюры на одежду молодоженов (этот
        обычай называется «билетным танцем»);
        жених исполняет для невесты любовную песню.</li>
    </ul>
    <p>На свадьбы в народном стиле мексиканцы чаще всего приглашают профессиональные ансамбли музыкантов «мариячос»,
      состоящие из нескольких гитаристов, скрипачей, трубачей. Они играют танцевальную музыку, поют народные и
      современные песни.<br>

      Рождение ребенка древними обрядами не обставляется. Большинство мексиканцев религиозны, люди старше 30 лет ходят в
      церковь не реже раза в неделю. Обряд католического крещения для младенцев считается обязательным.<br>

    <p>В мексиканской семье обычны 2–3 ребенка, для которых родители не жалеют ничего. Когда дети женятся и уходят в
      собственный дом, родители продолжают опекать их. В свою очередь, взрослые дети помогают пожилым родителям. Близкие
      отношения семья поддерживает и со всеми родственниками, которых зачастую набирается несколько десятков.</p>
    Многие мексиканские женщины не работают, посвящая всю жизнь домашним заботам и детям. После свадьбы невестка и
    свекровь становятся подругами, помогают друг другу во всем. По всем важным вопросам мужчина советуется с женой и
    родителями. Муж в семье занят зарабатыванием денег, даже для мелкого домашнего ремонта мексиканцы вызывают мастера.
    Но искупать, накормить, одеть ребенка для мексиканского мужчины не зазорно. Досуг мексиканцы проводят в домашнем
    кругу, ходят на прогулки и в кино.
    </p>
    <h2>Национальная кухня</h2>
    <p>Основой мексиканской еды становятся маис (кукуруза) в виде муки и зерен, мясо (говядина, птица). Несмотря на это,
      кухня разнообразна, в ней выделяются такие оригинальные блюда:</p>
    <ul>
      <li>тортийя (лепешка из кукурузной муки становится основой для блюд с начинкой — гордитас, такос, кесадийя,
        синхронизада): посоле (густой суп из мяса и кукурузных зерен);</li>
      <li>тинга (курица кусочками, тушеная с сальсой и луком);</li>
      <li>фрихоль (пюре из черной фасоли).</li>
    </ul>
    <p>Во все блюда мексиканцы добавляют перец чили, пряности, травы. К остроте мексиканской еды нужно привыкнуть.<br>

      Стремление к американскому образу жизни у мексиканцев проявляется в неумеренном потреблении «Кока-колы». Сладкий
      напиток в больших количествах пьют с утра до вечера и везде — на улице, в застольях, на работе и дома.
      Национальные крепкие алкогольные напитки текилу, мескаль (водки из кактуса) мексиканцы употребляют умеренно. В
      жаркую погоду мужчины предпочитают пить пульке (подобие густого пива из сока голубой агавы) или обычное пиво.</p>

    <h2>Мексиканские праздники</h2>
    <p>В календаре Мексики насчитывается более двух десятков официальных праздников с выходными днями. При этом наемным
      работникам выходные оплачиваются только в Новый год, на Рождество, а также в Дни:</p>
    <ul>
      <li>Конституции (5 февраля);</li>
      <li> Труда (1 мая);</li>
      <li>Независимости (16 сентября);</li>
      <li>Революции (20 ноября).</li>
      <li>Раз в шесть лет праздничным днем становится 1 декабря — день принятия присяги президентом после выборов.</li>
    </ul>
    <p>ЭТО ИНТЕРЕСНО! Уникальным официальным праздником в Мексике стал день рождения Бенито Хуареса (21 марта), которого
      называют «отцом мексиканской нации».</p>

    <h2>День Независимости</h2>
    <p>Главным официальным праздником в стране стал День Независимости. В этот день (16 сентября 1810 г.) начались
      крестьянские волнения, вылившиеся в движение за независимость Мексики от Испании. В праздничный день закрываются
      все школы и магазины. В Мехико проходит военный парад, на улицах всех мексиканских городов — карнавалы. На
      импровизированных сценах селений разыгрываются спектакли о войне за независимость.</p>
    <h2>Рождество</h2>
    <p>Отмечать Рождество в Мексике начинают задолго до 24 декабря. В каждом городе по центральным улицам проходят
      карнавальные процессии, впереди которых несут фигуры Девы Марии и Иосифа. Шествие символически ищет ночлег
      библейской паре.<br>
      В рождественский праздник местные жители участвуют в театрализованных представлениях, изображая встречу с волхвами
      или другие сцены из библии. Вечер Рождества мексиканцы проводят в семейном кругу, за столом. Угощением становятся
      рождественские блюда «тамале» (тесто с мясом, завернутое в кукурузные листья) и «бунуэлос» (сладкие хрустящие
      лепешки). Обязательно пьют горячий напиток «атоле», который связывают с процветанием. Этот сладкий безалкогольный
      отвар из кукурузной муки придуман еще ацтеками.<br>
      После ужина родители дарят детям рождественские подарки. Чаще всего маленькие мексиканцы получают «пиньяту». Малыш
      должен разбить яркую игрушку из папье-маше палкой, чтобы получить спрятанные внутри конфеты, пряники, шоколад.</p>
    <h2>Новый Год</h2>
    <p>Новый год многие мексиканцы выполняют такие обряды:</p>
    <ul>
      <li>выметают мусор из дома через порог (вместе с ним уходят беды);</li>
      <li>кладут монету в обувь, чтобы призвать деньги;</li>
      <li>выливают на улицу воду через открытую дверь или окно, чтобы из дома ушли слезы;</li>
      <li>съедают 12 ягод винограда, загадывая желание на каждый месяц.</li>
      <li>Кроме общенациональных праздников, каждый мексиканский городок или поселение с размахом празднует день своего
        святого покровителя.</li>
    </ul>
    <p>Перед Великим постом вся страна участвует в Карнавальной неделе. Для иностранных туристов это лучшее время
      путешествия по Мексике — в каждом городке они увидят фейерверки, танцы, карнавальные шествия, услышат выступления
      уличных музыкантов.</p>
  </div>
</template>

<script>
export default {
  name: 'CulturePage',
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
.background {
  background: url('@/assets/culture.jpg');
  z-index: -1;
  width: 100%;
  height: 100%;
  position: fixed;
  filter: blur(3px);
}

.info {
  color: black;


}

p,
ul {
  text-align: justify;
  font-size: 20px;
}

.photo {
  background: url('@/assets/photo.jpg');
  height: 532px;
  width: 800px;
  display: inline-block;
}
</style>
